tmon/tmon/spec_dir/fio/log/fio_randw.log
Rand_W_Test: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=128
fio-3.16
Starting 1 process
Rand_W_Test: Laying out IO file (1 file / 1024MiB)

Rand_W_Test: (groupid=0, jobs=1): err= 0: pid=830012: Thu Mar  3 13:42:56 2022
  write: IOPS=239, BW=959KiB/s (982kB/s)(9.95MiB/10620msec); 0 zone resets
    slat (usec): min=8, max=101409, avg=3912.92, stdev=8575.03
    clat (msec): min=88, max=6640, avg=492.61, stdev=415.75
     lat (msec): min=89, max=6640, avg=496.52, stdev=418.40
    clat percentiles (msec):
     |  1.00th=[   93],  5.00th=[  101], 10.00th=[  130], 20.00th=[  178],
     | 30.00th=[  243], 40.00th=[  300], 50.00th=[  359], 60.00th=[  405],
     | 70.00th=[  634], 80.00th=[  726], 90.00th=[ 1020], 95.00th=[ 1452],
     | 99.00th=[ 1636], 99.50th=[ 1653], 99.90th=[ 2836], 99.95th=[ 3574],
     | 99.99th=[ 6611]
   bw (  KiB/s): min=    8, max= 2984, per=100.00%, avg=1011.95, stdev=893.95, samples=19
   iops        : min=    2, max=  746, avg=252.89, stdev=223.54, samples=19
  lat (msec)   : 100=5.07%, 250=26.55%, 500=34.41%, 750=15.87%, 1000=7.86%
  lat (msec)   : 2000=10.09%, >=2000=0.16%
  cpu          : usr=2.48%, sys=90.44%, ctx=578, majf=0, minf=226
  IO depths    : 1=0.1%, 2=0.1%, 4=0.2%, 8=0.3%, 16=0.6%, 32=1.3%, >=64=97.5%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,2546,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=959KiB/s (982kB/s), 959KiB/s-959KiB/s (982kB/s-982kB/s), io=9.95MiB (10.4MB), run=10620-10620msec

Disk stats (read/write):
  sda: ios=2547/3678, merge=0/13, ticks=89794/80802, in_queue=170596, util=86.51%